jenkins/Taurus Jenkins Logs/2016-09-12_10-43-36.480288/effective.yml
---
cli-aliases:
  cloud:
    provisioning: cloud
  detach:
    modules:
      cloud:
        detach: true
  gui:
    modules:
      jmeter:
        gui: true
  local:
    provisioning: local
  locations:
    modules:
      cloud:
        dump-locations: true
    provisioning: cloud
  report:
    reporting:
    - blazemeter
execution:
  concurrency: 200
  distributed: []
  executor: jmeter
  hold-for: 5m
  ramp-up: 30s
  scenario: simple
install-id: c8843905-b92c-4f70-b648-47b394eef70f
modules:
  ab:
    class: bzt.modules.ab.ApacheBenchmarkExecutor
  blazemeter:
    class: bzt.modules.blazemeter.BlazeMeterUploader
    test: Taurus Demo
    token: '********'
  chrome-metric-reporter:
    class: bzt.modules.chrome.MetricReporter
  chrome-profiler:
    class: bzt.modules.chrome.ChromeProfiler
    processors:
      trace:
        class: bzt.modules.chrome.TraceProcessor
        extractors:
        - bzt.modules.chrome.TabNameExtractor
        - bzt.modules.chrome.MemoryMetricsExtractor
  cloud:
    class: bzt.modules.blazemeter.CloudProvisioning
    default-location: us-central1-a
  console:
    class: bzt.modules.console.ConsoleStatusReporter
    disable: false
  consolidator:
    buffer-multiplier: 2
    buffer-scale-choice: 0.5
    class: bzt.modules.aggregator.ConsolidatingAggregator
    generalize-labels: false
    ignore-labels:
    - ignore
    max-buffer-len: .inf
    min-buffer-len: 2
    percentiles:
    - 0.0
    - 50.0
    - 90.0
    - 95.0
    - 99.0
    - 99.9
    - 100.0
  final_stats:
    class: bzt.modules.reporting.FinalStatus
  gatling:
    class: bzt.modules.gatling.GatlingExecutor
    properties:
      gatling.data.file.bufferSize: 256
  grinder:
    class: bzt.modules.grinder.GrinderExecutor
    path: ~/.bzt/grinder-taurus/lib/grinder.jar
    properties:
      grinder.useConsole: false
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    download-link: null
    gui: true
    path: /Users/sidnarang/.bzt/jmeter-taurus/bin/jmeter.sh
    plugins:
    - jpgc-casutg
    - jpgc-dummy
    - jpgc-ffw
    - jpgc-fifo
    - jpgc-functions
    - jpgc-json
    - jpgc-perfmon
    - jpgc-prmctl
    - jpgc-tst
    properties:
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeterengine.force.system.exit: 'true'
      mode: Stripped
      summariser.name: ''
    shutdown-port: 4445
    version: '3.0'
  jtl-loader: bzt.modules.jmeter.JMeterJTLLoaderExecutor
  junit-xml:
    class: bzt.modules.reporting.JUnitXMLReporter
  local:
    class: bzt.modules.provisioning.Local
  locust:
    class: bzt.modules.locustio.LocustIOExecutor
  monitoring:
    class: bzt.modules.monitoring.Monitoring
  passfail:
    class: bzt.modules.passfail.PassFailStatus
  pbench:
    class: bzt.modules.pbench.PBenchExecutor
  proxy2jmx:
    class: bzt.modules.proxy2jmx.Proxy2JMX
  selenium:
    class: bzt.modules.selenium.SeleniumExecutor
    selenium-tools:
      junit:
        hamcrest-core: ~/.bzt/selenium-taurus/tools/junit/hamcrest-core.jar
        jar-name: compiled.jar
        path: ~/.bzt/selenium-taurus/tools/junit/junit.jar
        selenium-server: ~/.bzt/selenium-taurus/selenium-server.jar
        working-dir: classes
      nose:
        working-dir: classes
  shellexec:
    class: bzt.modules.shellexec.ShellExecutor
  siege:
    class: bzt.modules.siege.SiegeExecutor
  tsung:
    class: bzt.modules.tsung.TsungExecutor
  unpacker:
    class: bzt.modules.services.Unpacker
provisioning: local
reporting:
- final_stats
- console
scenarios:
  simple:
  - label: IndexPage
    url: http://blazedemo.com/
  - label: CheckoutPage
    url: http://blazedemo.com/checkout.php
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
  module: monitoring
- criteria:
  - condition: '>'
    fail: true
    label: IndexPage
    logic: for
    message: null
    stop: true
    subject: avg-rt
    threshold: 150ms
    timeframe: 10s
  - condition: '>'
    fail: true
    label: CheckoutPage
    logic: for
    message: null
    stop: true
    subject: fail
    threshold: 50%
    timeframe: 10s
  criterias: []
  module: passfail
settings:
  aggregator: consolidator
  artifacts-dir: '%Y-%m-%d_%H-%M-%S.%f'
  check-interval: 1
  check-updates: true
  default-executor: jmeter
  proxy: {}
version: 1.6.8